In [1]:
import numpy as np
import pandas as pd

# Combining data frames

<ul>
<li>Concat</li>
<li>Join</li>
<li>Merge</li>
</ul>

# Concat

In [2]:
df1 = pd.DataFrame({
    "customer":['101','102','103','104'],
    'category':['cat1','cat2','cat3','cat4'],
    'important':[True,False,True,False],
    'sales':[123,52,214,663]
},index = [0,1,2,3])


df2 = pd.DataFrame({
    "customer":['101','103','104','105'], 
    'color': ['yellow','green','green','blue'],
    'distance': [12,9,44,21],
    'sales': [124,214,663,331]
},index=[4,5,6,7])

print(df1)
print(df2)

  customer category  important  sales
0      101     cat1       True    123
1      102     cat2      False     52
2      103     cat3       True    214
3      104     cat4      False    663
  customer   color  distance  sales
4      101  yellow        12    124
5      103   green         9    214
6      104   green        44    663
7      105    blue        21    331

In [3]:
pd.concat([df1,df2],axis =0)

  customer category important  sales   color  distance
0      101     cat1      True    123     NaN       NaN
1      102     cat2     False     52     NaN       NaN
2      103     cat3      True    214     NaN       NaN
3      104     cat4     False    663     NaN       NaN
4      101      NaN       NaN    124  yellow      12.0
5      103      NaN       NaN    214   green       9.0
6      104      NaN       NaN    663   green      44.0
7      105      NaN       NaN    331    blue      21.0

In [4]:
pd.concat([df1,df2],axis =1)

  customer category important  sales customer   color  distance  sales
0      101     cat1      True  123.0      NaN     NaN       NaN    NaN
1      102     cat2     False   52.0      NaN     NaN       NaN    NaN
2      103     cat3      True  214.0      NaN     NaN       NaN    NaN
3      104     cat4     False  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN      101  yellow      12.0  124.0
5      NaN      NaN       NaN    NaN      103   green       9.0  214.0
6      NaN      NaN       NaN    NaN      104   green      44.0  663.0
7      NaN      NaN       NaN    NaN      105    blue      21.0  331.0

# Merge and Join

Merge combines dataframes using a column's values to identify common entries

Join combines dataframes using the index to identify common entries

In [5]:
pd.merge(df1,df2,how='outer',on='customer') # outer merge is union of on

  customer category important  sales_x   color  distance  sales_y
0      101     cat1      True    123.0  yellow      12.0    124.0
1      102     cat2     False     52.0     NaN       NaN      NaN
2      103     cat3      True    214.0   green       9.0    214.0
3      104     cat4     False    663.0   green      44.0    663.0
4      105      NaN       NaN      NaN    blue      21.0    331.0

In [6]:
pd.merge(df1,df2,how='inner',on='customer') # inner merge is interesction of on

  customer category  important  sales_x   color  distance  sales_y
0      101     cat1       True      123  yellow        12      124
1      103     cat3       True      214   green         9      214
2      104     cat4      False      663   green        44      663

In [7]:
pd.merge(df1,df2,how='right',on='customer') # right merge is just first on, but all columns ... left is second

  customer category important  sales_x   color  distance  sales_y
0      101     cat1      True    123.0  yellow        12      124
1      103     cat3      True    214.0   green         9      214
2      104     cat4     False    663.0   green        44      663
3      105      NaN       NaN      NaN    blue        21      331

In [8]:
pd.merge(df1,df2,how='left',on='customer') # left merge is just first on, but all columns ... right is second

  customer category  important  sales_x   color  distance  sales_y
0      101     cat1       True      123  yellow      12.0    124.0
1      102     cat2      False       52     NaN       NaN      NaN
2      103     cat3       True      214   green       9.0    214.0
3      104     cat4      False      663   green      44.0    663.0

In [9]:
df3 = pd.DataFrame({
    "customer":['101','102','103','104'],
    'category':['cat1','cat2','cat3','cat4'],
    'important':[True,False,True,False],
},index = [0,1,2,3])


df4 = pd.DataFrame({ 
    'color': ['yellow','green','green','blue'],
    'distance': [12,9,44,21],
    'sales': [124,214,663,331]
},index=[4,5,6,7])

In [10]:
df3.join(df4,how = 'right') # outer,inner,left and right

  customer category important   color  distance  sales
4      NaN      NaN       NaN  yellow        12    124
5      NaN      NaN       NaN   green         9    214
6      NaN      NaN       NaN   green        44    663
7      NaN      NaN       NaN    blue        21    331

## Adding a row to a dataframe

In [11]:
df1

  customer category  important  sales
0      101     cat1       True    123
1      102     cat2      False     52
2      103     cat3       True    214
3      104     cat4      False    663

In [12]:
df1.loc[3] = [105,'cat5',False,430]

In [13]:
df1

  customer category  important  sales
0      101     cat1       True    123
1      102     cat2      False     52
2      103     cat3       True    214
3      105     cat5      False    430

In [14]:
df1.loc[len(df1.index)] = [106,'cat6',False,470]

In [15]:
df1.head()

  customer category  important  sales
0      101     cat1       True    123
1      102     cat2      False     52
2      103     cat3       True    214
3      105     cat5      False    430
4      106     cat6      False    470

In [16]:
df1.loc[df1.index.values] = [106,'cat6',False,470] # not recommended, below is reason why

In [17]:
df1.index.values

array([0, 1, 2, 3, 4], dtype=int64)

In [18]:
df1

  customer category  important  sales
0      106     cat6      False    470
1      106     cat6      False    470
2      106     cat6      False    470
3      106     cat6      False    470
4      106     cat6      False    470

## Deleting row from data frame

In [19]:
# find that row 
df2 = df1.copy()

In [20]:
df2

  customer category  important  sales
0      106     cat6      False    470
1      106     cat6      False    470
2      106     cat6      False    470
3      106     cat6      False    470
4      106     cat6      False    470

In [21]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   customer   5 non-null      object
 1   category   5 non-null      object
 2   important  5 non-null      bool
 3   sales      5 non-null      int64
dtypes: bool(1), int64(1), object(2)
memory usage: 253.0+ bytes

In [22]:
df2[df2['customer'] == '103']

Empty DataFrame
Columns: [customer, category, important, sales]
Index: []

In [23]:
df2

  customer category  important  sales
0      106     cat6      False    470
1      106     cat6      False    470
2      106     cat6      False    470
3      106     cat6      False    470
4      106     cat6      False    470

In [24]:
df2[df2['customer'] != '103']

  customer category  important  sales
0      106     cat6      False    470
1      106     cat6      False    470
2      106     cat6      False    470
3      106     cat6      False    470
4      106     cat6      False    470

In [25]:
df2 = df2[df2['customer'] != '103']

In [26]:
df2

  customer category  important  sales
0      106     cat6      False    470
1      106     cat6      False    470
2      106     cat6      False    470
3      106     cat6      False    470
4      106     cat6      False    470

## Add columns

In [27]:
df2['dummycol'] = [100,100,100,100]

ValueError: Length of values (4) does not match length of index (5)

In [ ]:
df2

## Delete columns

In [ ]:
df2 = df2.drop(['dummycol'],axis =1)

In [ ]:
df2

## Adding customizable changes

In [ ]:
## Prework - Unrelated 

df2['salaries'] = [12000,13000,11000,10000]

## Give 15% raise to all employees in the dataframe

In [ ]:
df2

In [ ]:
def raisesal(col):
    col = col+0.15*col
    return col

In [ ]:
df2['salaries'] =  df2['salaries'].apply(raisesal)

In [ ]:
df2

## Saving the dataframe to csv or excel file

In [ ]:
df2.to_csv("df2.csv",index = True) # default = True, include indexes, False, dont include

In [ ]:
df = pd.read_csv("df2.csv")

In [ ]:
df

## Saving the dataframe to an excel file

In [ ]:
student = pd.DataFrame({
    'name': ['Harshal','Saatvik','Adarsh','Raj'],
    'rollno' : [1,2,3,4],
    'marks' : [25,23,22,21],
    'subject': ['VAVR']*4
})

In [ ]:
student

In [ ]:
student.to_excel("student.xlsx",sheet_name = 'scores')

In [ ]:
student.to_excel("student.xlsx",sheet_name = 'scores_backup')

In [ ]:
st_df = pd.read_excel("student.xlsx",index_col=0)

In [ ]:
st_df

## Saving multiple dataframes to multiple sheets in one excel file

In [ ]:
# !pip install xlwt
# !pip install xlsxwriter

In [ ]:
writer = pd.ExcelWriter("student.xlsx",engine = 'xlsxwriter' )

student.to_excel(writer,sheet_name = 'scores')
student.to_excel(writer,sheet_name = 'scores_backup')

writer.save()